using Microsoft.EntityFrameworkCore.Metadata;
using Microsoft.EntityFrameworkCore.Migrations;

namespace EducationalGame.Migrations
{
    public partial class EducationalGameDB : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "Principals",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Name = table.Column<string>(maxLength: 30, nullable: false),
                    FamilyName = table.Column<string>(maxLength: 30, nullable: false),
                    City = table.Column<string>(maxLength: 30, nullable: false),
                    SchoolName = table.Column<string>(maxLength: 100, nullable: false),
                    UserName = table.Column<string>(maxLength: 30, nullable: false),
                    Password = table.Column<string>(maxLength: 255, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Principals", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "QuizCategories",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    QuizCategoryName = table.Column<string>(maxLength: 100, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_QuizCategories", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Teachers",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Name = table.Column<string>(maxLength: 30, nullable: false),
                    FamilyName = table.Column<string>(maxLength: 30, nullable: false),
                    City = table.Column<string>(maxLength: 30, nullable: false),
                    SchoolName = table.Column<string>(maxLength: 100, nullable: false),
                    UserName = table.Column<string>(maxLength: 30, nullable: false),
                    Password = table.Column<string>(maxLength: 255, nullable: false),
                    PrincipalId = table.Column<int>(nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Teachers", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Teachers_Principals_PrincipalId",
                        column: x => x.PrincipalId,
                        principalTable: "Principals",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                });

            migrationBuilder.CreateTable(
                name: "GameQuizes",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Question = table.Column<string>(maxLength: 255, nullable: false),
                    Answer = table.Column<string>(maxLength: 50, nullable: false),
                    QuizCategoryId = table.Column<int>(nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_GameQuizes", x => x.Id);
                    table.ForeignKey(
                        name: "FK_GameQuizes_QuizCategories_QuizCategoryId",
                        column: x => x.QuizCategoryId,
                        principalTable: "QuizCategories",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                });

            migrationBuilder.CreateTable(
                name: "Students",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Name = table.Column<string>(maxLength: 30, nullable: false),
                    FamilyName = table.Column<string>(maxLength: 30, nullable: false),
                    City = table.Column<string>(maxLength: 30, nullable: false),
                    SchoolName = table.Column<string>(maxLength: 100, nullable: false),
                    UserName = table.Column<string>(maxLength: 30, nullable: false),
                    Password = table.Column<string>(maxLength: 255, nullable: false),
                    Coins = table.Column<long>(nullable: false),
                    TotalPoints = table.Column<long>(nullable: false),
                    TeacherId = table.Column<int>(nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Students", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Students_Teachers_TeacherId",
                        column: x => x.TeacherId,
                        principalTable: "Teachers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                });

            migrationBuilder.CreateTable(
                name: "StudentGameQuizes",
                columns: table => new
                {
                    StudentId = table.Column<int>(nullable: false),
                    GameQuizId = table.Column<int>(nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_StudentGameQuizes", x => new { x.StudentId, x.GameQuizId });
                    table.ForeignKey(
                        name: "FK_StudentGameQuizes_GameQuizes_GameQuizId",
                        column: x => x.GameQuizId,
                        principalTable: "GameQuizes",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_StudentGameQuizes_Students_StudentId",
                        column: x => x.StudentId,
                        principalTable: "Students",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                table: "QuizCategories",
                columns: new[] { "Id", "QuizCategoryName" },
                values: new object[] { 1, "Човекът и заобикалящия го свят" });

            migrationBuilder.InsertData(
                table: "QuizCategories",
                columns: new[] { "Id", "QuizCategoryName" },
                values: new object[] { 2, "Нашата красива България" });

            migrationBuilder.InsertData(
                table: "QuizCategories",
                columns: new[] { "Id", "QuizCategoryName" },
                values: new object[] { 3, "България в Средновековна Европа" });

            migrationBuilder.InsertData(
                table: "GameQuizes",
                columns: new[] { "Id", "Answer", "Question", "QuizCategoryId" },
                values: new object[,]
                {
                    { 1, "СЛЪНЦЕ", "Най-близката до нас звезда, която ни осигурява светлина и топлина", 1 },
                    { 107, "ИВАН АСЕН ВТОРИ", "Кой български цар през 1230 година победил при село Клокотница епирския владетел Теодор Комнин?", 3 },
                    { 108, "ДЕСПОТ", "Първи помощник на царя", 3 },
                    { 109, "ТЪРНОВО", "Коя била столицата на Втората Българска държава?", 3 },
                    { 110, "СУЛТАН", "В края на 14 век, през 1396 година, средновековна България попаднала под османска власт. Как се наричал този, който стоял начело на Османската империя?", 3 },
                    { 111, "ИСЛЯМ", "Каква религия изповядвали османците?", 3 },
                    { 112, "АСПАРУХ", "От кой владетел, през 681 година, била създадена българската държава?", 3 },
                    { 113, "АСЕН И ПЕТЪР", "С въстанието на кои двама братя било възобновено Българското царство през 1185 година?", 3 },
                    { 114, "ПЕРУН", "Кой бог почитали славяните, преди да приемат християнството?", 3 },
                    { 115, "ОХРИД", "Кой град бил столица на България при царуването на Самуил?", 3 },
                    { 116, "БИБЛИЯ", "Свещената книга на християните", 3 },
                    { 117, "КАДИЯ", "Мюсюлмански съдия", 3 },
                    { 118, "ХАЛИФ", "Титла на политическия и религиозен водач на мюсюлманската общност", 3 },
                    { 119, "РИЦАР", "Тежковъоръжен конник с благородно потекло в Западна Европа, за когото войната била професия", 3 },
                    { 120, "КЕСАР", "Най-високата титла във Византия след тази на императора. Хан Тервел бил единствения чужд владетел, който я получил. Той се прославил като спасител на  Европа от арабското нашествие.", 3 },
                    { 121, "ВИКИНГИ", "Племена, които населявали Скандинавския полуостров, предци на днешните датчани, норвежци, шведи и исландци", 3 },
                    { 122, "ЦАР", "Титла на славянски владетел, равна на императорската", 3 },
                    { 123, "СИНОД", "Ръководен орган на Християнските църкви в европейския Изток", 3 },
                    { 106, "КАЛОЯН", "Кой български владетел през 1205 година победил латинците /кръстоносците/ при Одрин и пленил техния император Балдуин?", 3 },
                    { 124, "КАТОЛИК", "Християнин от Западна Европа", 3 },
                    { 105, "СИМЕОН", "Управлението на кой български цар се определя като \"Златен век на българската култура\" ?", 3 },
                    { 103, "КОРАН", "Свещената книга на мюсюлманите", 3 },
                    { 86, "АЛБЕНА", "Красив курорт по българското черноморско крайбрежие, на север от град Варна", 2 },
                    { 87, "ГЛАРУС", "Птица, която обикновено можем да видим на българското Черноморие", 2 },
                    { 88, "ЕЗЕРО", "Вдлъбнатина в земна повърхност, запълнена с вода", 2 },
                    { 89, "ЯЗОВИР", "Изкуствено езеро, създадено от хората, когато реката се прегради със стена", 2 },
                    { 90, "МОРЕ", "Голямо количество солена вода, обградена изцяло или само отчасти със земя", 2 },
                    { 91, "БАНСКО", "Известен зимен курорт в планината Пирин ", 2 },
                    { 92, "НИЗИНА", "Много ниска и равна земна форма край река или море", 2 },
                    { 93, "ДОБРУДЖА", "Там се ражда повечето жито за хляба на нашата трапеза. Наричат я \"житницата\" на България", 2 },
                    { 94, "ИЗТОК", "Като се обърнеш с лице към географската карта коя посока на света сочи дясната ти ръка ?", 2 },
                    { 95, "ЗАПАД", "Една от посоките на света. Като сме с лице и разперени ръце към географската карта лявата ни ръка я показва ", 2 },
                    { 96, "КРУМ", "От кой хан са били създадени първите писани закони в България?", 3 },
                    { 97, "ОМУРТАГ", "При кой хан се извършила голяма строителна дейност и била възстановена разрушената столица?", 3 },
                    { 98, "БОРИС", "При кой български владетел става покръстването на българите, приемането на християнската вяра?", 3 },
                    { 99, "ПРЕСЛАВ", "Кой град е бил столица на България по време на покръстването?", 3 },
                    { 100, "САМУИЛ", "Войниците на кой български цар били пленени и ослепени от византийския император Василий Втори?", 3 },
                    { 101, "ДЖАМИЯ", "Как се нарича молитвеният дом на мюсюлманите?", 3 },
                    { 102, "МЮСЮЛМАНИ", "Вярващи, които изповядват исляма", 3 },
                    { 104, "ТАНГРА", "Кой бог почитали прабългарите?", 3 },
                    { 85, "АРДА", "По бреговете на коя река е разположен град Кърджали", 2 },
                    { 125, "КАТЕДРАЛА", "Главна градска църква", 3 },
                    { 127, "КРЪСТОНОСЦИ", "Участници в кръстоносните походи, получили името си от кръста, който поставили върху наметалата си", 3 },
                    { 149, "ХАЙДУТИН", "Отмъстител и народен закрилник за българите по време на османската власт", 3 },
                    { 150, "ИКОНА", "Изображение на Бог, Света Богородица, светци или библейски сцени, изписвано върху гладка дървена основа", 3 },
                    { 151, "ГЕОРГИ РАКОВСКИ", "Името на български революционер, признат за родоначалник на организираната борба за свобода", 3 },
                    { 152, "ЧЕТА", "Група от въоръжени хора, участници в освободителните борби", 3 },
                    { 153, "ЛЕГИЯ", "Доброволчески отряд преди Освобождението, създаден в Белград, българска войска", 3 },
                    { 154, "БУКУРЕЩ", "В кой румънски град през 1869 година бил създаден Българският революционен централен комитет?", 3 },
                    { 155, "ЛЮБЕН КАРАВЕЛОВ", "Кой застанал начело на Българския ревеволюционен централен комитет, създаден  през 1869 година в Букурещ?", 3 },
                    { 156, "ВАСИЛ ЛЕВСКИ", "Кой обикалял страната и създавал революционни комитети за подготовка на въстание?", 3 },
                    { 157, "ХРИСТО БОТЕВ", "Български поет-революционер, загинал за свободата на България на 2 юни 1876 година", 3 },
                    { 158, "ПАНАЙОТ ВОЛОВ", "Името на главния апостол в Панагюрище", 3 },
                    { 159, "ГЕОРГИ БЕНКОВСКИ", "Кой бил водач на \"Хвърковатата чета\" по време на Априлското въстание?", 3 },
                    { 160, "РАЙНА ПОПГЕОРГИЕВА", "Кой ушил и извезал  знамето на панагюрци по време на Априлското въстание през 1876 година?", 3 },
                    { 161, "ТРЕТИ МАРТ", "Националният празник на страната ни е свързан с Освобождението на България от османска власт през 1878 година.Коя е датата?", 3 },
                    { 162, "ПАИСИЙ", "Кой български възрожденец през 1762 година е написал \"История славянобългарска\" ?", 3 },
                    { 163, "БУДИТЕЛ", "Как се нарича човек, който води сънародниците си по пътя към духовен напредък?", 3 },
                    { 164, "ПЕТЪР БЕРОН", "Името на народен будител, написал през 1824 година първия български учебник, известен като \"Рибен буквар\"", 3 },
                    { 165, "ГАБРОВО", "В кой град през 1835 година било открито първото светско училище в България?", 3 },
                    { 148, "ЕСНАФ", "Професионална организация на занаятчиите от една професия, която защитавала интересите на своите членове", 3 },
                    { 126, "СВЕТА ИНКВИЗИЦИЯ", "Съдебна институция на Католическата църква за борба срущу еретиците", 3 },
                    { 147, "ЧАРШИЯ", "Стопанският център на градовете, търговска улица", 3 },
                    { 145, "ДЕСЯТЪК", "Годишен данък в размер на една десета част от всички добиви, който всяко селско семейство изплащало на спахията", 3 },
                    { 128, "АНГЛИЯ", "Една от държавите, участници в Стогодишната война, продължила от 1337 година до 1453 година", 3 },
                    { 129, "ДЕСПОТ", "Титла на самостоятелен владетел", 3 },
                    { 130, "ВЕЗИР", "Висш държавен служител - министър в Османската империя", 3 },
                    { 131, "ЕНИЧАРИ", "Войници от османската пехота, набирани от християнското население чрез т.нар. кръвен данък /девширме/ и преминали през специално обучение", 3 },
                    { 132, "СРЕДНОВЕКОВИЕ", "Историческа епоха, която обхваща времето от 5 век до 15 век", 3 },
                    { 133, "ЦЪРКВА", "Православен християнски храм", 3 },
                    { 134, "УНИВЕРСИТЕТ", "Висше училище, общност от преподаватели и студенти, която се самоуправлява", 3 },
                    { 135, "ЕРЕС", "Учение, което се отклонява от общоприетите принципи на Християнската църква", 3 },
                    { 136, "ПАТРИАРХ", "Духовен глава на православната християнска църква", 3 },
                    { 137, "ПАПА", "Духовен глава на християните в Западна Европа", 3 },
                    { 138, "КРАЛ", "Титла на владетел в Западна Европа", 3 },
                    { 139, "МАНАСТИР", "Религиозна общност от монаси или монахини, която има свой устав и се ръководи от игумен или игуменка   /в Западна Европа  -абат или абатиса /", 3 },
                    { 140, "ВАРВАРИ", "Как наричали римляните всички останали народи, чийто език не разбирали и които не принадлежали на тяхната култура", 3 },
                    { 141, "ХАН", "Титла на племенен вожд или на самостоятелен владетел при древните българи", 3 },
                    { 142, "КНЯЗ", "Титла на племенен вожд или на самостоятелен владетел при славяните", 3 },
                    { 143, "ВАСИЛЕВС", "Титла на византийския император", 3 },
                    { 144, "РАЯ", "Всички поданици на султана независимо от своята вяра и произход, които плащат данъци", 3 },
                    { 146, "СПАХИЯ", "Войник от османската конница, на който султанът давал земя, от чиито приходи се издържал, докато му служи ", 3 },
                    { 166, "ШИПКА", "На кой връх в Стара планина през август 1877 година българските опълченци проявили изключителен героизъм и успели да спрат турската армия?", 3 },
                    { 84, "ПАМПОРОВО", "Зимен курорт близо до град Смолян", 2 },
                    { 82, "ЯМБОЛ", "Град разположен на река Тунджа", 2 },
                    { 23, "ПРАСЕ", "Всеядно животно.", 1 },
                    { 24, "КИТ", "Воден бозайник.", 1 },
                    { 25, "ПРИЛЕП", "Летящ бозайник.", 1 },
                    { 26, "КОРЕН", "Орган, с който растението всмуква от почвата вода и минерални вещества.", 1 },
                    { 27, "МЕД", "Хранителен продукт, богат на въглехидрати.", 1 },
                    { 28, "СТОМАХ", "Орган на храносмилателната система.", 1 },
                    { 29, "ВИРУС", "Причинител на дихателни заболявания.", 1 },
                    { 30, "БЪБРЕК", "Основен орган на отделителната система.", 1 },
                    { 31, "МЕСО", "Хранителен продукт, богат на белтъчини", 1 },
                    { 32, "НОС", "Орган от дихателната система на човека", 1 },
                    { 33, "ГРИП", "Основна болест на дихателната система", 1 },
                    { 34, "ХЕПАТИТ", "Основна болест на храносмилателната система ", 1 },
                    { 35, "КРАВА", "Тревопасно животно", 1 },
                    { 36, "ВЪЛК", "Месояден бозайник", 1 },
                    { 37, "ДЕЛФИН", "Воден бозайник", 1 },
                    { 38, "РИБИ", "Група животни, които живеят във водата и дишат с хриле", 1 },
                    { 39, "ЧАКАЛ", "Представител на род \"кучета\"", 1 },
                    { 22, "КОМАР", "Кръвосмучещо насекомо.", 1 },
                    { 40, "ЛЪВ", "Представител на род \"котки\"", 1 },
                    { 21, "ЛИСИЦА", "Месояден бозайник.", 1 },
                    { 19, "АМЕБА", "Едноклетъчно животно.", 1 },
                    { 2, "МАРС", "Една от планетите в Слънчевата система.", 1 },
                    { 3, "ЛУНА", "Кой е единственият естествен спътник на Земята ?", 1 },
                    { 4, "ЗЕМЯ", "Планета от Слънчевата система, която предоставя условия за живот на всички живи същества.", 1 },
                    { 5, "ЮРИЙ ГАГАРИН", "Името на първия човек, направил обиколка около Земята с космически кораб. /1961 г./", 1 },
                    { 6, "ГЕОРГИ ИВАНОВ", "Името на първия български космонавт.", 1 },
                    { 7, "ЗВЕЗДИ", "Естествени небесни тела, които светят със собствена светлина.", 1 },
                    { 8, "ПЛАНЕТИ", "Тела, които светят с отразена слънчева светлина.", 1 },
                    { 9, "ТОН", "Единица за маса на телата, равна на 1000 кг.", 1 },
                    { 10, "ВОДА", "Вещество в природата, което /в твърдо състояние/ се топи при 0 градуса по Целзий, а на морското равнище кипи при 100 градуса по Целзий.", 1 },
                    { 11, "ФОРМА", "Три са основните характеристики на телата. Една от тях. Коя е тя? Опитайте се да познаете! ", 1 },
                    { 12, "ЦВЯТ", "Едно от по-важните свойства на веществата. Кое е то?", 1 },
                    { 13, "СМЕС", "Какво представлява въздухът?", 1 },
                    { 14, "ВИТАМИНИ", "Едно от основните вещества, които съставят нашата храна. Има го в плодовете и зеленчуците.", 1 },
                    { 15, "НИКОТИН", "Вещество, вредно за  здравето на човека и застрашаващо неговия организъм.", 1 },
                    { 16, "КЛЕТКА", "Основната градивна единица на всички организми", 1 },
                    { 17, "ЛУПА", "Най-просто устроеният увеличителен уред, който увеличава образа на обектите от 2 до 30 пъти.", 1 },
                    { 18, "БАКТЕРИИ", "Едноклетъчни организми с много малки размери, полезни и вредни за човека.", 1 },
                    { 20, "КОН", "Растителноядно /тревопасно/ животно.", 1 },
                    { 83, "БОРОВЕЦ", "Известен български курорт близо до град Самоков", 2 },
                    { 41, "АСТЕРОИДИ", "Небесни тела с малка маса, малки размери и обикновено неправилна форма. Намират се между орбитите на Марс и Юпитер.", 1 },
                    { 43, "МЕТЕОРИ", "Малки твърди части от комети или от други небесни тела, които навлизат в земната атмосфера и изгарят  -  \"падащи звезди\"", 1 },
                    { 65, "СИН", "С какъв цвят се изобразяват на географската карта реките, езерата, моретата?", 2 },
                    { 66, "ТУРЦИЯ", "С коя държава граничим на югоизток?", 2 },
                    { 67, "БОТЕВ", "Най-високият връх в Стара планина", 2 },
                    { 68, "СЪРБИЯ", "Държава на Балканския полуостров, с която граничим на запад", 2 },
                    { 69, "ВИХРЕН", "Най-високият връх в Пирин планина", 2 },
                    { 70, "БАТАК", "Град в България, където по време на Априлското въстание през 1876 година са избити много българи", 2 },
                    { 71, "НОС", "Коя земна форма отговаря на описанието - \"остро вдадена в морето суша\"?", 2 },
                    { 72, "ПЛАЖОВЕТЕ", "Най-голямото природно богатство на Черноморското крайбрежие", 2 },
                    { 73, "ВИТОША ", "Планина, която е близо до нашата столица  град София", 2 },
                    { 74, "СРЕБЪРНА", "Резерват за редки птици, недалече от град Силистра", 2 },
                    { 75, "КОЗЛОДУЙ", "Край кой български град се намира най-голямата електроцентрала у нас ?", 2 },
                    { 76, "ОСЪМ", "Река, която извира от Стара планина. На нея е разположен град Ловеч. Кое е нейното име ?", 2 },
                    { 77, "ЛОВЕЧ", "Град, който е разположен на река Осъм. Наричат го  \"града на люляците\".", 2 },
                    { 78, "ГАБРОВО", "Град, разположен по течението на река Янтра. Тук е открита първата гимназия в България - \"Априловската\". Край града се намира музеят на открито - Етъра\"", 2 },
                    { 79, "СЛИВЕН", "Град, в който е открита първата българска фабрика за производство на платове още през 1834 година", 2 },
                    { 80, "КАЗАНЛЪК", "Български град - \"градът на розите\"", 2 },
                    { 81, "ПЛОВДИВ", "Вторият по големина град в България", 2 },
                    { 64, "ЧЕРНО МОРЕ", "Източната граница на България", 2 },
                    { 42, "КОМЕТИ", "Светли петна, от които излиза опашка, когато минават близо до Слънцето  -  \"опашати звезди\"", 1 },
                    { 63, "ОСТРОВ", "Коя земна форма отговаря на описанието - \"суша, заобиколена от всички страни с вода\"?", 2 },
                    { 61, "РОДОПИ", "Коя е най-обширната българска планина?", 2 },
                    { 44, "КАФЯВ", "С какъв цвят се означават планините на географската карта?", 2 },
                    { 45, "СОФИЯ  ", "Коя е столицата на България?", 2 },
                    { 46, "МАРИЦА", "Река в България, минаваща през град Пловдив.", 2 },
                    { 47, "МУСАЛА", "Кой е най-високият връх в България?", 2 },
                    { 48, "ВАРНА", "Голям български град, наричан \"морската столица на България\".", 2 },
                    { 49, "ГЪРЦИЯ", "Европейска държава, с която България граничи на юг.", 2 },
                    { 50, "РИЛА", "Най-високата планина в България.", 2 },
                    { 51, "КАРЛОВО", "Град в България - родно място на Васил Левски.", 2 },
                    { 52, "СОПОТ", "Родното място на Иван Вазов", 2 },
                    { 53, "СТАРА ПЛАНИНА", "Най-дългата планина в България.", 2 },
                    { 54, "ОКОТО", "Името на едно от рилските езера.", 2 },
                    { 55, "ЕВРОПА", "На кой континент се намира България?", 2 },
                    { 56, "ДУНАВ", "Гранична българска река.", 2 },
                    { 57, "РУСЕ", "Голям крайдунавски град.", 2 },
                    { 58, "ВЕЛИКО ТЪРНОВО", "Град - столица на Второто Българско царство.", 2 },
                    { 59, "ЗЕЛЕН", "С какъв цвят се означават равнините на географската карта?", 2 },
                    { 60, "СЕВЕР", "Каква посока показва горната част на географската карта?", 2 },
                    { 62, "ИСКЪР", "Коя е най-дългата българска река?", 2 },
                    { 167, "НИКОЛА ФИЧЕВ", "Името на известен български майстор през Възраждането, построил покрития мост в Ловеч, къщата с \"маймунката\" във Велико Търново и много други строежи", 3 }
                });

            migrationBuilder.CreateIndex(
                name: "IX_GameQuizes_QuizCategoryId",
                table: "GameQuizes",
                column: "QuizCategoryId");

            migrationBuilder.CreateIndex(
                name: "IX_StudentGameQuizes_GameQuizId",
                table: "StudentGameQuizes",
                column: "GameQuizId");

            migrationBuilder.CreateIndex(
                name: "IX_Students_TeacherId",
                table: "Students",
                column: "TeacherId");

            migrationBuilder.CreateIndex(
                name: "IX_Teachers_PrincipalId",
                table: "Teachers",
                column: "PrincipalId");
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "StudentGameQuizes");

            migrationBuilder.DropTable(
                name: "GameQuizes");

            migrationBuilder.DropTable(
                name: "Students");

            migrationBuilder.DropTable(
                name: "QuizCategories");

            migrationBuilder.DropTable(
                name: "Teachers");

            migrationBuilder.DropTable(
                name: "Principals");
        }
    }
}
